name: "clip_text_preprocess"
backend: "python"
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1 ]  # 表示动态维度
  }
]
output [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]  # 表示动态批次大小和序列长度
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  }
]
instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]
dynamic_batching {
    max_queue_delay_microseconds: 100
}
